logs/f3d050cf-b0b8-4ce8-a021-a6b74033367a/01_FlightAvailability_RQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:FlightAvailability>
         <tem:strAgencyCode>TESTAPI</tem:strAgencyCode>
         <tem:strPassword>APITEST@123NP@@</tem:strPassword>
         <tem:strOrigin>KTM</tem:strOrigin>
         <tem:strDestination>POK</tem:strDestination>
         <tem:strDepartFrom>20260220</tem:strDepartFrom>
         <tem:strDepartTo>20260220</tem:strDepartTo>
         <tem:strReturnFrom>20260220</tem:strReturnFrom>
         <tem:strReturnTo>20260220</tem:strReturnTo>
         <tem:iAdult>1</tem:iAdult>
         <tem:iChild>0</tem:iChild>
         <tem:iInfant>0</tem:iInfant>
         <tem:iOther>0</tem:iOther>
         <tem:nationality>NP</tem:nationality>
         <tem:strBookingClass></tem:strBookingClass>
         <tem:strBoardingClass></tem:strBoardingClass>
         <tem:strPromoCode></tem:strPromoCode>
         <tem:strLanguageCode>EN</tem:strLanguageCode>
      </tem:FlightAvailability>
   </soapenv:Body>
</soapenv:Envelope>